Revit 2027 API
NumberingSchema.MatchGeometry Property
 If true the matching for this numbering schema will consider the geometry of the input elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool MatchGeometry { get; set; }
Public Property MatchGeometry As Boolean
	Get
	Set
public:
property bool MatchGeometry {
	bool get ();
	void set (bool value);
}
member MatchGeometry : bool with get, set
Property Value
Boolean
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace